Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
     + recreate_pods              = false
17:35:00.687 STDOUT terraform1.11.0:       + render_subchart_notes      = true
17:35:00.687 STDOUT terraform1.11.0:       + replace                    = false
17:35:00.687 STDOUT terraform1.11.0:       + repository                 = "oci://registry-1.docker.io/bitnamicharts"
17:35:00.687 STDOUT terraform1.11.0:       + reset_values               = false
17:35:00.687 STDOUT terraform1.11.0:       + reuse_values               = false
17:35:00.687 STDOUT terraform1.11.0:       + skip_crds                  = false
17:35:00.687 STDOUT terraform1.11.0:       + status                     = "deployed"
17:35:00.687 STDOUT terraform1.11.0:       + timeout                    = 300
17:35:00.687 STDOUT terraform1.11.0:       + values                     = [
17:35:00.687 STDOUT terraform1.11.0:           + <<-EOT
17:35:00.687 STDOUT terraform1.11.0:                 "auth":
17:35:00.687 STDOUT terraform1.11.0:                   "database": "app"
17:35:00.687 STDOUT terraform1.11.0:                   "existingSecret": "postgresql-credentials"
17:35:00.687 STDOUT terraform1.11.0:                   "secretKeys":
17:35:00.687 STDOUT terraform1.11.0:                     "adminPasswordKey": "password"
17:35:00.687 STDOUT terraform1.11.0:                 "image":
17:35:00.687 STDOUT terraform1.11.0:                   "pullPolicy": "IfNotPresent"
17:35:00.687 STDOUT terraform1.11.0:                   "tag": "latest"
17:35:00.687 STDOUT terraform1.11.0:                 "primary":
17:35:00.687 STDOUT terraform1.11.0:                   "persistence":
17:35:00.687 STDOUT terraform1.11.0:                     "enabled": true
17:35:00.687 STDOUT terraform1.11.0:                     "size": "10Gi"
17:35:00.687 STDOUT terraform1.11.0:                     "storageClass": "local-path-retain"
17:35:00.687 STDOUT terraform1.11.0:                   "resources":
17:35:00.688 STDOUT terraform1.11.0:                     "limits":
17:35:00.688 STDOUT terraform1.11.0:                       "cpu": "500m"
17:35:00.688 STDOUT terraform1.11.0:                       "memory": "512Mi"
17:35:00.688 STDOUT terraform1.11.0:                     "requests":
17:35:00.688 STDOUT terraform1.11.0:                       "cpu": "100m"
17:35:00.688 STDOUT terraform1.11.0:                       "memory": "128Mi"
17:35:00.688 STDOUT terraform1.11.0:             EOT,
17:35:00.688 STDOUT terraform1.11.0:         ]
17:35:00.688 STDOUT terraform1.11.0:       + verify                     = false
17:35:00.688 STDOUT terraform1.11.0:       + version                    = "16.4.2"
17:35:00.688 STDOUT terraform1.11.0:       + wait                       = true
17:35:00.688 STDOUT terraform1.11.0:       + wait_for_jobs              = true
17:35:00.688 STDOUT terraform1.11.0:     }
17:35:00.688 STDOUT terraform1.11.0:   # helm_release.redis will be created
17:35:00.688 STDOUT terraform1.11.0:   + resource "helm_release" "redis" {
17:35:00.688 STDOUT terraform1.11.0:       + atomic                     = false
17:35:00.688 STDOUT terraform1.11.0:       + chart                      = "redis"
17:35:00.688 STDOUT terraform1.11.0:       + cleanup_on_fail            = false
17:35:00.688 STDOUT terraform1.11.0:       + create_namespace           = false
17:35:00.688 STDOUT terraform1.11.0:       + dependency_update          = false
17:35:00.688 STDOUT terraform1.11.0:       + disable_crd_hooks          = false
17:35:00.688 STDOUT terraform1.11.0:       + disable_openapi_validation = false
17:35:00.688 STDOUT terraform1.11.0:       + disable_webhooks           = false
17:35:00.688 STDOUT terraform1.11.0:       + force_update               = false
17:35:00.688 STDOUT terraform1.11.0:       + id                         = (known after apply)
17:35:00.688 STDOUT terraform1.11.0:       + lint                       = false
17:35:00.688 STDOUT terraform1.11.0:       + manifest                   = (known after apply)
17:35:00.688 STDOUT terraform1.11.0:       + max_history                = 0
17:35:00.688 STDOUT terraform1.11.0:       + metadata                   = (known after apply)
17:35:00.688 STDOUT terraform1.11.0:       + name                       = "redis"
17:35:00.688 STDOUT terraform1.11.0:       + namespace                  = "data-staging"
17:35:00.689 STDOUT terraform1.11.0:       + pass_credentials           = false
17:35:00.689 STDOUT terraform1.11.0:       + recreate_pods              = false
17:35:00.689 STDOUT terraform1.11.0:       + render_subchart_notes      = true
17:35:00.689 STDOUT terraform1.11.0:       + replace                    = false
17:35:00.689 STDOUT terraform1.11.0:       + repository                 = "oci://registry-1.docker.io/bitnamicharts"
17:35:00.689 STDOUT terraform1.11.0:       + reset_values               = false
17:35:00.689 STDOUT terraform1.11.0:       + reuse_values               = false
17:35:00.689 STDOUT terraform1.11.0:       + skip_crds                  = false
17:35:00.689 STDOUT terraform1.11.0:       + status                     = "deployed"
17:35:00.689 STDOUT terraform1.11.0:       + timeout                    = 300
17:35:00.689 STDOUT terraform1.11.0:       + values                     = [
17:35:00.689 STDOUT terraform1.11.0:           + <<-EOT
17:35:00.689 STDOUT terraform1.11.0:                 "auth":
17:35:00.689 STDOUT terraform1.11.0:                   "existingSecret": "redis-credentials"
17:35:00.689 STDOUT terraform1.11.0:                   "existingSecretPasswordKey": "password"
17:35:00.689 STDOUT terraform1.11.0:                 "image":
17:35:00.689 STDOUT terraform1.11.0:                   "pullPolicy": "IfNotPresent"
17:35:00.689 STDOUT terraform1.11.0:                   "tag": "latest"
17:35:00.689 STDOUT terraform1.11.0:                 "master":
17:35:00.689 STDOUT terraform1.11.0:                   "configuration": |
17:35:00.689 STDOUT terraform1.11.0:                     appendonly yes
17:35:00.689 STDOUT terraform1.11.0:                     appendfsync everysec
17:35:00.689 STDOUT terraform1.11.0:                     save 900 1
17:35:00.689 STDOUT terraform1.11.0:                     save 300 10
17:35:00.689 STDOUT terraform1.11.0:                     save 60 10000
17:35:00.689 STDOUT terraform1.11.0:                   "persistence":
17:35:00.689 STDOUT terraform1.11.0:                     "enabled": true
17:35:00.689 STDOUT terraform1.11.0:                     "size": "2Gi"
17:35:00.689 STDOUT terraform1.11.0:                     "storageClass": "local-path-retain"
17:35:00.689 STDOUT terraform1.11.0:                   "resources":
17:35:00.689 STDOUT terraform1.11.0:                     "limits":
17:35:00.689 STDOUT terraform1.11.0:                       "cpu": "200m"
17:35:00.689 STDOUT terraform1.11.0:                       "memory": "256Mi"
17:35:00.689 STDOUT terraform1.11.0:                     "requests":
17:35:00.689 STDOUT terraform1.11.0:                       "cpu": "50m"
17:35:00.689 STDOUT terraform1.11.0:                       "memory": "64Mi"
17:35:00.689 STDOUT terraform1.11.0:                 "replica":
17:35:00.689 STDOUT terraform1.11.0:                   "replicaCount": 0
17:35:00.689 STDOUT terraform1.11.0:             EOT,
17:35:00.689 STDOUT terraform1.11.0:         ]
17:35:00.689 STDOUT terraform1.11.0:       + verify                     = false
17:35:00.690 STDOUT terraform1.11.0:       + version                    = "20.6.0"
17:35:00.690 STDOUT terraform1.11.0:       + wait                       = true
17:35:00.690 STDOUT terraform1.11.0:       + wait_for_jobs              = true
17:35:00.690 STDOUT terraform1.11.0:     }
17:35:00.690 STDOUT terraform1.11.0:   # kubectl_manifest.arangodb_deployment will be created
17:35:00.690 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "arangodb_deployment" {
17:35:00.690 STDOUT terraform1.11.0:       + api_version             = "database.arangodb.com/v1"
17:35:00.690 STDOUT terraform1.11.0:       + apply_only              = false
17:35:00.690 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:00.690 STDOUT terraform1.11.0:       + force_conflicts         = false
17:35:00.690 STDOUT terraform1.11.0:       + force_new               = false
17:35:00.690 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:00.690 STDOUT terraform1.11.0:       + kind                    = "ArangoDeployment"
17:35:00.690 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:00.690 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:00.690 STDOUT terraform1.11.0:       + name                    = "arangodb"
17:35:00.690 STDOUT terraform1.11.0:       + namespace               = "data-staging"
17:35:00.690 STDOUT terraform1.11.0:       + server_side_apply       = false
17:35:00.690 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:00.690 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:00.690 STDOUT terraform1.11.0:       + wait_for_rollout        = true
17:35:00.690 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:00.690 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:00.690 STDOUT terraform1.11.0:             apiVersion: database.arangodb.com/v1
17:35:00.690 STDOUT terraform1.11.0:             kind: ArangoDeployment
17:35:00.690 STDOUT terraform1.11.0:             metadata:
17:35:00.690 STDOUT terraform1.11.0:               name: arangodb
17:35:00.691 STDOUT terraform1.11.0:               namespace: data-staging
17:35:00.691 STDOUT terraform1.11.0:             spec:
17:35:00.691 STDOUT terraform1.11.0:               auth:
17:35:00.691 STDOUT terraform1.11.0:                 jwtSecretName: arangodb-credentials
17:35:00.691 STDOUT terraform1.11.0:               image: arangodb/arangodb:3.11.8
17:35:00.691 STDOUT terraform1.11.0:               mode: Single
17:35:00.691 STDOUT terraform1.11.0:               single:
17:35:00.691 STDOUT terraform1.11.0:                 count: 1
17:35:00.691 STDOUT terraform1.11.0:                 resources:
17:35:00.691 STDOUT terraform1.11.0:                   limits:
17:35:00.691 STDOUT terraform1.11.0:                     cpu: 500m
17:35:00.691 STDOUT terraform1.11.0:                     memory: 512Mi
17:35:00.691 STDOUT terraform1.11.0:                   requests:
17:35:00.691 STDOUT terraform1.11.0:                     cpu: 100m
17:35:00.691 STDOUT terraform1.11.0:                     memory: 128Mi
17:35:00.691 STDOUT terraform1.11.0:                 volumeClaimTemplate:
17:35:00.691 STDOUT terraform1.11.0:                   spec:
17:35:00.691 STDOUT terraform1.11.0:                     accessModes:
17:35:00.691 STDOUT terraform1.11.0:                     - ReadWriteOnce
17:35:00.691 STDOUT terraform1.11.0:                     resources:
17:35:00.691 STDOUT terraform1.11.0:                       requests:
17:35:00.691 STDOUT terraform1.11.0:                         storage: 5Gi
17:35:00.691 STDOUT terraform1.11.0:                     storageClassName: local-path-retain
17:35:00.691 STDOUT terraform1.11.0:         EOT
17:35:00.691 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:00.691 STDOUT terraform1.11.0:     }
17:35:00.691 STDOUT terraform1.11.0:   # kubectl_manifest.arangodb_vault_secret will be created
17:35:00.691 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "arangodb_vault_secret" {
17:35:00.691 STDOUT terraform1.11.0:       + api_version             = "secrets.hashicorp.com/v1beta1"
17:35:00.691 STDOUT terraform1.11.0:       + apply_only              = false
17:35:00.691 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:00.691 STDOUT terraform1.11.0:       + force_conflicts         = false
17:35:00.691 STDOUT terraform1.11.0:       + force_new               = false
17:35:00.691 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:00.691 STDOUT terraform1.11.0:       + kind                    = "VaultStaticSecret"
17:35:00.691 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:00.691 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:00.691 STDOUT terraform1.11.0:       + name                    = "arangodb-credentials"
17:35:00.692 STDOUT terraform1.11.0:       + namespace               = "data-staging"
17:35:00.692 STDOUT terraform1.11.0:       + server_side_apply       = false
17:35:00.692 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:00.692 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:00.692 STDOUT terraform1.11.0:       + wait_for_rollout        = true
17:35:00.692 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:00.692 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:00.692 STDOUT terraform1.11.0:             apiVersion: secrets.hashicorp.com/v1beta1
17:35:00.692 STDOUT terraform1.11.0:             kind: VaultStaticSecret
17:35:00.692 STDOUT terraform1.11.0:             metadata:
17:35:00.692 STDOUT terraform1.11.0:               name: arangodb-credentials
17:35:00.692 STDOUT terraform1.11.0:               namespace: data-staging
17:35:00.692 STDOUT terraform1.11.0:             spec:
17:35:00.692 STDOUT terraform1.11.0:               destination:
17:35:00.692 STDOUT terraform1.11.0:                 create: true
17:35:00.692 STDOUT terraform1.11.0:                 name: arangodb-credentials
17:35:00.692 STDOUT terraform1.11.0:               mount: secret
17:35:00.692 STDOUT terraform1.11.0:               path: arangodb
17:35:00.692 STDOUT terraform1.11.0:               refreshAfter: 1h
17:35:00.692 STDOUT terraform1.11.0:               type: kv-v2
17:35:00.692 STDOUT terraform1.11.0:               vaultAuthRef: default
17:35:00.692 STDOUT terraform1.11.0:         EOT
17:35:00.692 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:00.692 STDOUT terraform1.11.0:     }
17:35:00.692 STDOUT terraform1.11.0:   # kubectl_manifest.clickhouse_vault_secret will be created
17:35:00.692 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "clickhouse_vault_secret" {
17:35:00.692 STDOUT terraform1.11.0:       + api_version             = "secrets.hashicorp.com/v1beta1"
17:35:00.692 STDOUT terraform1.11.0:       + apply_only              = false
17:35:00.692 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:00.692 STDOUT terraform1.11.0:       + force_conflicts         = false
17:35:00.692 STDOUT terraform1.11.0:       + force_new               = false
17:35:00.692 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:00.692 STDOUT terraform1.11.0:       + kind                    = "VaultStaticSecret"
17:35:00.693 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:00.693 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:00.693 STDOUT terraform1.11.0:       + name                    = "clickhouse-credentials"
17:35:00.693 STDOUT terraform1.11.0:       + namespace               = "data-staging"
17:35:00.693 STDOUT terraform1.11.0:       + server_side_apply       = false
17:35:00.693 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:00.693 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:00.693 STDOUT terraform1.11.0:       + wait_for_rollout        = true
17:35:00.693 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:00.693 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:00.693 STDOUT terraform1.11.0:             apiVersion: secrets.hashicorp.com/v1beta1
17:35:00.693 STDOUT terraform1.11.0:             kind: VaultStaticSecret
17:35:00.693 STDOUT terraform1.11.0:             metadata:
17:35:00.693 STDOUT terraform1.11.0:               name: clickhouse-credentials
17:35:00.693 STDOUT terraform1.11.0:               namespace: data-staging
17:35:00.693 STDOUT terraform1.11.0:             spec:
17:35:00.693 STDOUT terraform1.11.0:               destination:
17:35:00.693 STDOUT terraform1.11.0:                 create: true
17:35:00.693 STDOUT terraform1.11.0:                 name: clickhouse-credentials
17:35:00.693 STDOUT terraform1.11.0:               mount: secret
17:35:00.693 STDOUT terraform1.11.0:               path: clickhouse
17:35:00.693 STDOUT terraform1.11.0:               refreshAfter: 1h
17:35:00.693 STDOUT terraform1.11.0:               type: kv-v2
17:35:00.693 STDOUT terraform1.11.0:               vaultAuthRef: default
17:35:00.693 STDOUT terraform1.11.0:         EOT
17:35:00.693 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:00.693 STDOUT terraform1.11.0:     }
17:35:00.693 STDOUT terraform1.11.0:   # kubectl_manifest.openpanel_postgres_init will be created
17:35:00.693 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "openpanel_postgres_init" {
17:35:00.693 STDOUT terraform1.11.0:       + api_version             = "batch/v1"
17:35:00.693 STDOUT terraform1.11.0:       + apply_only              = false
17:35:00.693 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:00.693 STDOUT terraform1.11.0:       + force_conflicts         = false
17:35:00.693 STDOUT terraform1.11.0:       + force_new               = false
17:35:00.693 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:00.694 STDOUT terraform1.11.0:       + kind                    = "Job"
17:35:00.694 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:00.694 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:00.694 STDOUT terraform1.11.0:       + name                    = "openpanel-postgres-init"
17:35:00.694 STDOUT terraform1.11.0:       + namespace               = "data-staging"
17:35:00.694 STDOUT terraform1.11.0:       + server_side_apply       = false
17:35:00.694 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:00.694 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:00.694 STDOUT terraform1.11.0:       + wait_for_rollout        = true
17:35:00.694 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:00.694 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:00.694 STDOUT terraform1.11.0:             apiVersion: batch/v1
17:35:00.694 STDOUT terraform1.11.0:             kind: Job
17:35:00.694 STDOUT terraform1.11.0:             metadata:
17:35:00.694 STDOUT terraform1.11.0:               labels:
17:35:00.694 STDOUT terraform1.11.0:                 app: openpanel
17:35:00.694 STDOUT terraform1.11.0:                 purpose: db-init
17:35:00.694 STDOUT terraform1.11.0:               name: openpanel-postgres-init
17:35:00.694 STDOUT terraform1.11.0:               namespace: data-staging
17:35:00.694 STDOUT terraform1.11.0:             spec:
17:35:00.694 STDOUT terraform1.11.0:               backoffLimit: 3
17:35:00.694 STDOUT terraform1.11.0:               template:
17:35:00.694 STDOUT terraform1.11.0:                 spec:
17:35:00.694 STDOUT terraform1.11.0:                   containers:
17:35:00.694 STDOUT terraform1.11.0:                   - args:
17:35:00.694 STDOUT terraform1.11.0:                     - -c
17:35:00.694 STDOUT terraform1.11.0:                     - |
17:35:00.694 STDOUT terraform1.11.0:                       set -e
17:35:00.694 STDOUT terraform1.11.0:                       echo "Waiting for PostgreSQL..."
17:35:00.694 STDOUT terraform1.11.0:                       until pg_isready -h postgresql -U postgres -t 5; do sleep 2; done
17:35:00.694 STDOUT terraform1.11.0:             
17:35:00.694 STDOUT terraform1.11.0:                       echo "Creating OpenPanel user..."
17:35:00.694 STDOUT terraform1.11.0:                       psql -h postgresql -U postgres -tc "SELECT 1 FROM pg_roles WHERE rolname='openpanel'" | grep -q 1 || \
17:35:00.694 STDOUT terraform1.11.0:                         psql -h postgresql -U postgres -c "CREATE USER openpanel WITH PASSWORD '$OPENPANEL_PASSWORD';"
17:35:00.695 STDOUT terraform1.11.0:             
17:35:00.695 STDOUT terraform1.11.0:                       echo "Creating OpenPanel database..."
17:35:00.695 STDOUT terraform1.11.0:                       psql -h postgresql -U postgres -tc "SELECT 1 FROM pg_database WHERE datname='openpanel'" | grep -q 1 || \
17:35:00.695 STDOUT terraform1.11.0:                         psql -h postgresql -U postgres -c "CREATE DATABASE openpanel OWNER openpanel;"
17:35:00.695 STDOUT terraform1.11.0:             
17:35:00.695 STDOUT terraform1.11.0:                       echo "OpenPanel PostgreSQL setup complete"
17:35:00.695 STDOUT terraform1.11.0:                     command:
17:35:00.695 STDOUT terraform1.11.0:                     - /bin/sh
17:35:00.695 STDOUT terraform1.11.0:                     env:
17:35:00.695 STDOUT terraform1.11.0:                     - name: PGPASSWORD
17:35:00.695 STDOUT terraform1.11.0:                       valueFrom:
17:35:00.695 STDOUT terraform1.11.0:                         secretKeyRef:
17:35:00.695 STDOUT terraform1.11.0:                           key: password
17:35:00.695 STDOUT terraform1.11.0:                           name: postgresql-credentials
17:35:00.695 STDOUT terraform1.11.0:                     - name: OPENPANEL_PASSWORD
17:35:00.695 STDOUT terraform1.11.0:                       value: E7xSU49XEbyLh8oS8ZyNPKRG
17:35:00.695 STDOUT terraform1.11.0:                     image: postgres:16-alpine
17:35:00.695 STDOUT terraform1.11.0:                     name: psql-init
17:35:00.695 STDOUT terraform1.11.0:                   restartPolicy: OnFailure
17:35:00.695 STDOUT terraform1.11.0:               ttlSecondsAfterFinished: 86400
17:35:00.695 STDOUT terraform1.11.0:         EOT
17:35:00.695 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:00.695 STDOUT terraform1.11.0:     }
17:35:00.695 STDOUT terraform1.11.0:   # kubectl_manifest.postgres_vault_secret will be created
17:35:00.695 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "postgres_vault_secret" {
17:35:00.695 STDOUT terraform1.11.0:       + api_version             = "secrets.hashicorp.com/v1beta1"
17:35:00.695 STDOUT terraform1.11.0:       + apply_only              = false
17:35:00.695 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:00.695 STDOUT terraform1.11.0:       + force_conflicts         = false
17:35:00.695 STDOUT terraform1.11.0:       + force_new               = false
17:35:00.695 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:00.695 STDOUT terraform1.11.0:       + kind                    = "VaultStaticSecret"
17:35:00.696 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:00.696 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:00.696 STDOUT terraform1.11.0:       + name                    = "postgresql-credentials"
17:35:00.696 STDOUT terraform1.11.0:       + namespace               = "data-staging"
17:35:00.696 STDOUT terraform1.11.0:       + server_side_apply       = false
17:35:00.696 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:00.696 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:00.696 STDOUT terraform1.11.0:       + wait_for_rollout        = true
17:35:00.696 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:00.696 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:00.696 STDOUT terraform1.11.0:             apiVersion: secrets.hashicorp.com/v1beta1
17:35:00.696 STDOUT terraform1.11.0:             kind: VaultStaticSecret
17:35:00.696 STDOUT terraform1.11.0:             metadata:
17:35:00.696 STDOUT terraform1.11.0:               name: postgresql-credentials
17:35:00.696 STDOUT terraform1.11.0:               namespace: data-staging
17:35:00.696 STDOUT terraform1.11.0:             spec:
17:35:00.696 STDOUT terraform1.11.0:               destination:
17:35:00.696 STDOUT terraform1.11.0:                 create: true
17:35:00.696 STDOUT terraform1.11.0:                 name: postgresql-credentials
17:35:00.696 STDOUT terraform1.11.0:               mount: secret
17:35:00.696 STDOUT terraform1.11.0:               path: postgres
17:35:00.696 STDOUT terraform1.11.0:               refreshAfter: 1h
17:35:00.696 STDOUT terraform1.11.0:               type: kv-v2
17:35:00.696 STDOUT terraform1.11.0:               vaultAuthRef: default
17:35:00.696 STDOUT terraform1.11.0:         EOT
17:35:00.696 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:00.696 STDOUT terraform1.11.0:     }
17:35:00.696 STDOUT terraform1.11.0:   # kubectl_manifest.redis_vault_secret will be created
17:35:00.696 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "redis_vault_secret" {
17:35:00.696 STDOUT terraform1.11.0:       + api_version             = "secrets.hashicorp.com/v1beta1"
17:35:00.696 STDOUT terraform1.11.0:       + apply_only              = false
17:35:00.696 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:00.696 STDOUT terraform1.11.0:       + force_conflicts         = false
17:35:00.696 STDOUT terraform1.11.0:       + force_new               = false
17:35:00.696 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:00.696 STDOUT terraform1.11.0:       + kind                    = "VaultStaticSecret"
17:35:00.697 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:00.697 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:00.697 STDOUT terraform1.11.0:       + name                    = "redis-credentials"
17:35:00.697 STDOUT terraform1.11.0:       + namespace               = "data-staging"
17:35:00.697 STDOUT terraform1.11.0:       + server_side_apply       = false
17:35:00.697 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:00.697 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:00.697 STDOUT terraform1.11.0:       + wait_for_rollout        = true
17:35:00.697 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:00.697 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:00.697 STDOUT terraform1.11.0:             apiVersion: secrets.hashicorp.com/v1beta1
17:35:00.697 STDOUT terraform1.11.0:             kind: VaultStaticSecret
17:35:00.697 STDOUT terraform1.11.0:             metadata:
17:35:00.697 STDOUT terraform1.11.0:               name: redis-credentials
17:35:00.697 STDOUT terraform1.11.0:               namespace: data-staging
17:35:00.697 STDOUT terraform1.11.0:             spec:
17:35:00.697 STDOUT terraform1.11.0:               destination:
17:35:00.697 STDOUT terraform1.11.0:                 create: true
17:35:00.697 STDOUT terraform1.11.0:                 name: redis-credentials
17:35:00.697 STDOUT terraform1.11.0:               mount: secret
17:35:00.697 STDOUT terraform1.11.0:               path: redis
17:35:00.697 STDOUT terraform1.11.0:               refreshAfter: 1h
17:35:00.697 STDOUT terraform1.11.0:               type: kv-v2
17:35:00.697 STDOUT terraform1.11.0:               vaultAuthRef: default
17:35:00.697 STDOUT terraform1.11.0:         EOT
17:35:00.697 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:00.697 STDOUT terraform1.11.0:     }
17:35:00.697 STDOUT terraform1.11.0:   # kubectl_manifest.vault_auth will be created
17:35:00.697 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "vault_auth" {
17:35:00.697 STDOUT terraform1.11.0:       + api_version             = "secrets.hashicorp.com/v1beta1"
17:35:00.697 STDOUT terraform1.11.0:       + apply_only              = false
17:35:00.697 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:35:00.697 STDOUT terraform1.11.0:       + force_conflicts         = false
17:35:00.697 STDOUT terraform1.11.0:       + force_new               = false
17:35:00.697 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:35:00.698 STDOUT terraform1.11.0:       + kind                    = "VaultAuth"
17:35:00.698 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:35:00.698 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:35:00.698 STDOUT terraform1.11.0:       + name                    = "default"
17:35:00.698 STDOUT terraform1.11.0:       + namespace               = "data-staging"
17:35:00.698 STDOUT terraform1.11.0:       + server_side_apply       = false
17:35:00.698 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:35:00.698 STDOUT terraform1.11.0:       + validate_schema         = true
17:35:00.698 STDOUT terraform1.11.0:       + wait_for_rollout        = true
17:35:00.698 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:35:00.698 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:35:00.698 STDOUT terraform1.11.0:             apiVersion: secrets.hashicorp.com/v1beta1
17:35:00.698 STDOUT terraform1.11.0:             kind: VaultAuth
17:35:00.698 STDOUT terraform1.11.0:             metadata:
17:35:00.698 STDOUT terraform1.11.0:               name: default
17:35:00.698 STDOUT terraform1.11.0:               namespace: data-staging
17:35:00.698 STDOUT terraform1.11.0:             spec:
17:35:00.698 STDOUT terraform1.11.0:               kubernetes:
17:35:00.698 STDOUT terraform1.11.0:                 audiences:
17:35:00.698 STDOUT terraform1.11.0:                 - vault
17:35:00.698 STDOUT terraform1.11.0:                 role: vault-secrets-operator
17:35:00.698 STDOUT terraform1.11.0:                 serviceAccount: default
17:35:00.698 STDOUT terraform1.11.0:               method: kubernetes
17:35:00.698 STDOUT terraform1.11.0:               mount: kubernetes
17:35:00.698 STDOUT terraform1.11.0:         EOT
17:35:00.698 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:35:00.698 STDOUT terraform1.11.0:     }
17:35:00.698 STDOUT terraform1.11.0:   # kubernetes_namespace.data will be created
17:35:00.698 STDOUT terraform1.11.0:   + resource "kubernetes_namespace" "data" {
17:35:00.698 STDOUT terraform1.11.0:       + id                               = (known after apply)
17:35:00.698 STDOUT terraform1.11.0:       + wait_for_default_service_account = false
17:35:00.698 STDOUT terraform1.11.0:       + metadata {
17:35:00.698 STDOUT terraform1.11.0:           + generation       = (known after apply)
17:35:00.698 STDOUT terraform1.11.0:           + labels           = {
17:35:00.698 STDOUT terraform1.11.0:               + "env"   = "staging"
17:35:00.699 STDOUT terraform1.11.0:               + "layer" = "L3"
17:35:00.699 STDOUT terraform1.11.0:             }
17:35:00.699 STDOUT terraform1.11.0:           + name             = "data-staging"
17:35:00.699 STDOUT terraform1.11.0:           + resource_version = (known after apply)
17:35:00.699 STDOUT terraform1.11.0:           + uid              = (known after apply)
17:35:00.699 STDOUT terraform1.11.0:         }
17:35:00.699 STDOUT terraform1.11.0:     }
17:35:00.699 STDOUT terraform1.11.0:   # time_sleep.wait_for_arangodb_crd will be created
17:35:00.699 STDOUT terraform1.11.0:   + resource "time_sleep" "wait_for_arangodb_crd" {
17:35:00.699 STDOUT terraform1.11.0:       + create_duration = "30s"
17:35:00.699 STDOUT terraform1.11.0:       + id              = (known after apply)
17:35:00.699 STDOUT terraform1.11.0:     }
17:35:00.699 STDOUT terraform1.11.0:   # time_sleep.wait_for_arangodb_secret will be created
17:35:00.699 STDOUT terraform1.11.0:   + resource "time_sleep" "wait_for_arangodb_secret" {
17:35:00.699 STDOUT terraform1.11.0:       + create_duration = "15s"
17:35:00.699 STDOUT terraform1.11.0:       + id              = (known after apply)
17:35:00.699 STDOUT terraform1.11.0:     }
17:35:00.699 STDOUT terraform1.11.0:   # time_sleep.wait_for_clickhouse will be created
17:35:00.699 STDOUT terraform1.11.0:   + resource "time_sleep" "wait_for_clickhouse" {
17:35:00.699 STDOUT terraform1.11.0:       + create_duration = "30s"
17:35:00.699 STDOUT terraform1.11.0:       + id              = (known after apply)
17:35:00.699 STDOUT terraform1.11.0:     }
17:35:00.699 STDOUT terraform1.11.0:   # time_sleep.wait_for_clickhouse_secret will be created
17:35:00.699 STDOUT terraform1.11.0:   + resource "time_sleep" "wait_for_clickhouse_secret" {
17:35:00.699 STDOUT terraform1.11.0:       + create_duration = "15s"
17:35:00.699 STDOUT terraform1.11.0:       + id              = (known after apply)
17:35:00.699 STDOUT terraform1.11.0:     }
17:35:00.699 STDOUT terraform1.11.0:   # time_sleep.wait_for_postgres_secret will be created
17:35:00.699 STDOUT terraform1.11.0:   + resource "time_sleep" "wait_for_postgres_secret" {
17:35:00.699 STDOUT terraform1.11.0:       + create_duration = "15s"
17:35:00.699 STDOUT terraform1.11.0:       + id              = (known after apply)
17:35:00.699 STDOUT terraform1.11.0:     }
17:35:00.699 STDOUT terraform1.11.0:   # time_sleep.wait_for_redis_secret will be created
17:35:00.700 STDOUT terraform1.11.0:   + resource "time_sleep" "wait_for_redis_secret" {
17:35:00.700 STDOUT terraform1.11.0:       + create_duration = "15s"
17:35:00.700 STDOUT terraform1.11.0:       + id              = (known after apply)
17:35:00.700 STDOUT terraform1.11.0:     }
17:35:00.700 STDOUT terraform1.11.0:   # time_sleep.wait_for_vso will be created
17:35:00.700 STDOUT terraform1.11.0:   + resource "time_sleep" "wait_for_vso" {
17:35:00.700 STDOUT terraform1.11.0:       + create_duration = "10s"
17:35:00.700 STDOUT terraform1.11.0:       + id              = (known after apply)
17:35:00.700 STDOUT terraform1.11.0:     }
17:35:00.700 STDOUT terraform1.11.0:   # vault_database_secret_backend_connection.postgres will be created
17:35:00.700 STDOUT terraform1.11.0:   + resource "vault_database_secret_backend_connection" "postgres" {
17:35:00.700 STDOUT terraform1.11.0:       + allowed_roles     = [
17:35:00.700 STDOUT terraform1.11.0:           + "postgres-readonly",
17:35:00.700 STDOUT terraform1.11.0:           + "postgres-readwrite",
17:35:00.700 STDOUT terraform1.11.0:         ]
17:35:00.700 STDOUT terraform1.11.0:       + backend           = "database"
17:35:00.700 STDOUT terraform1.11.0:       + id                = (known after apply)
17:35:00.700 STDOUT terraform1.11.0:       + name              = "postgres"
17:35:00.700 STDOUT terraform1.11.0:       + plugin_name       = (known after apply)
17:35:00.700 STDOUT terraform1.11.0:       + verify_connection = true
17:35:00.700 STDOUT terraform1.11.0:       + postgresql {
17:35:00.700 STDOUT terraform1.11.0:           + connection_url          = (sensitive value)
17:35:00.700 STDOUT terraform1.11.0:           + max_open_connections    = 2
17:35:00.700 STDOUT terraform1.11.0:           + password_authentication = "password"
17:35:00.700 STDOUT terraform1.11.0:         }
17:35:00.700 STDOUT terraform1.11.0:     }
17:35:00.700 STDOUT terraform1.11.0:   # vault_database_secret_backend_role.postgres_readonly will be created
17:35:00.700 STDOUT terraform1.11.0:   + resource "vault_database_secret_backend_role" "postgres_readonly" {
17:35:00.700 STDOUT terraform1.11.0:       + backend               = "database"
17:35:00.700 STDOUT terraform1.11.0:       + creation_statements   = [
17:35:00.700 STDOUT terraform1.11.0:           + "CREATE ROLE \"{{name}}\" WITH LOGIN PASSWORD '{{password}}' VALID UNTIL '{{expiration}}';",
17:35:00.701 STDOUT terraform1.11.0:           + "GRANT SELECT ON ALL TABLES IN SCHEMA public TO \"{{name}}\";",
17:35:00.701 STDOUT terraform1.11.0:           + "GRANT USAGE ON SCHEMA public TO \"{{name}}\";",
17:35:00.701 STDOUT terraform1.11.0:         ]
17:35:00.701 STDOUT terraform1.11.0:       + credential_type       = (known after apply)
17:35:00.701 STDOUT terraform1.11.0:       + db_name               = "postgres"
17:35:00.701 STDOUT terraform1.11.0:       + default_ttl           = 3600
17:35:00.701 STDOUT terraform1.11.0:       + id                    = (known after apply)
17:35:00.701 STDOUT terraform1.11.0:       + max_ttl               = 86400
17:35:00.701 STDOUT terraform1.11.0:       + name                  = "postgres-readonly"
17:35:00.701 STDOUT terraform1.11.0:       + revocation_statements = [
17:35:00.701 STDOUT terraform1.11.0:           + "REVOKE ALL PRIVILEGES ON ALL TABLES IN SCHEMA public FROM \"{{name}}\";",
17:35:00.701 STDOUT terraform1.11.0:           + "DROP ROLE IF EXISTS \"{{name}}\";",
17:35:00.701 STDOUT terraform1.11.0:         ]
17:35:00.701 STDOUT terraform1.11.0:     }
17:35:00.701 STDOUT terraform1.11.0:   # vault_database_secret_backend_role.postgres_readwrite will be created
17:35:00.701 STDOUT terraform1.11.0:   + resource "vault_database_secret_backend_role" "postgres_readwrite" {
17:35:00.701 STDOUT terraform1.11.0:       + backend               = "database"
17:35:00.701 STDOUT terraform1.11.0:       + creation_statements   = [
17:35:00.701 STDOUT terraform1.11.0:           + "CREATE ROLE \"{{name}}\" WITH LOGIN PASSWORD '{{password}}' VALID UNTIL '{{expiration}}';",
17:35:00.701 STDOUT terraform1.11.0:           + "GRANT SELECT, INSERT, UPDATE, DELETE ON ALL TABLES IN SCHEMA public TO \"{{name}}\";",
17:35:00.701 STDOUT terraform1.11.0:           + "GRANT USAGE, SELECT ON ALL SEQUENCES IN SCHEMA public TO \"{{name}}\";",
17:35:00.701 STDOUT terraform1.11.0:           + "GRANT USAGE ON SCHEMA public TO \"{{name}}\";",
17:35:00.701 STDOUT terraform1.11.0:         ]
17:35:00.701 STDOUT terraform1.11.0:       + credential_type       = (known after apply)
17:35:00.702 STDOUT terraform1.11.0:       + db_name               = "postgres"
17:35:00.702 STDOUT terraform1.11.0:       + default_ttl           = 3600
17:35:00.702 STDOUT terraform1.11.0:       + id                    = (known after apply)
17:35:00.702 STDOUT terraform1.11.0:       + max_ttl               = 86400
17:35:00.702 STDOUT terraform1.11.0:       + name                  = "postgres-readwrite"
17:35:00.702 STDOUT terraform1.11.0:       + revocation_statements = [
17:35:00.702 STDOUT terraform1.11.0:           + "REVOKE ALL PRIVILEGES ON ALL TABLES IN SCHEMA public FROM \"{{name}}\";",
17:35:00.702 STDOUT terraform1.11.0:           + "REVOKE ALL PRIVILEGES ON ALL SEQUENCES IN SCHEMA public FROM \"{{name}}\";",
17:35:00.702 STDOUT terraform1.11.0:           + "DROP ROLE IF EXISTS \"{{name}}\";",
17:35:00.702 STDOUT terraform1.11.0:         ]
17:35:00.702 STDOUT terraform1.11.0:     }
17:35:00.702 STDOUT terraform1.11.0:   # vault_kv_secret_v2.arangodb will be created
17:35:00.702 STDOUT terraform1.11.0:   + resource "vault_kv_secret_v2" "arangodb" {
17:35:00.702 STDOUT terraform1.11.0:       + data                = (sensitive value)
17:35:00.702 STDOUT terraform1.11.0:       + data_json           = (sensitive value)
17:35:00.702 STDOUT terraform1.11.0:       + delete_all_versions = true
17:35:00.702 STDOUT terraform1.11.0:       + disable_read        = false
17:35:00.702 STDOUT terraform1.11.0:       + id                  = (known after apply)
17:35:00.702 STDOUT terraform1.11.0:       + metadata            = (known after apply)
17:35:00.702 STDOUT terraform1.11.0:       + mount               = "secret"
17:35:00.702 STDOUT terraform1.11.0:       + name                = "arangodb"
17:35:00.702 STDOUT terraform1.11.0:       + path                = (known after apply)
17:35:00.702 STDOUT terraform1.11.0:       + custom_metadata (known after apply)
17:35:00.702 STDOUT terraform1.11.0:     }
17:35:00.702 STDOUT terraform1.11.0:   # vault_kv_secret_v2.clickhouse will be created
17:35:00.702 STDOUT terraform1.11.0:   + resource "vault_kv_secret_v2" "clickhouse" {
17:35:00.703 STDOUT terraform1.11.0:       + data                = (sensitive value)
17:35:00.703 STDOUT terraform1.11.0:       + data_json           = (sensitive value)
17:35:00.703 STDOUT terraform1.11.0:       + delete_all_versions = true
17:35:00.703 STDOUT terraform1.11.0:       + disable_read        = false
17:35:00.703 STDOUT terraform1.11.0:       + id                  = (known after apply)
17:35:00.703 STDOUT terraform1.11.0:       + metadata            = (known after apply)
17:35:00.703 STDOUT terraform1.11.0:       + mount               = "secret"
17:35:00.703 STDOUT terraform1.11.0:       + name                = "clickhouse"
17:35:00.703 STDOUT terraform1.11.0:       + path                = (known after apply)
17:35:00.703 STDOUT terraform1.11.0:       + custom_metadata (known after apply)
17:35:00.703 STDOUT terraform1.11.0:     }
17:35:00.703 STDOUT terraform1.11.0:   # vault_kv_secret_v2.openpanel will be created
17:35:00.703 STDOUT terraform1.11.0:   + resource "vault_kv_secret_v2" "openpanel" {
17:35:00.703 STDOUT terraform1.11.0:       + data                = (sensitive value)
17:35:00.703 STDOUT terraform1.11.0:       + data_json           = (sensitive value)
17:35:00.703 STDOUT terraform1.11.0:       + delete_all_versions = true
17:35:00.703 STDOUT terraform1.11.0:       + disable_read        = false
17:35:00.703 STDOUT terraform1.11.0:       + id                  = (known after apply)
17:35:00.703 STDOUT terraform1.11.0:       + metadata            = (known after apply)
17:35:00.703 STDOUT terraform1.11.0:       + mount               = "secret"
17:35:00.703 STDOUT terraform1.11.0:       + name                = "openpanel"
17:35:00.703 STDOUT terraform1.11.0:       + path                = (known after apply)
17:35:00.703 STDOUT terraform1.11.0:       + custom_metadata (known after apply)
17:35:00.703 STDOUT terraform1.11.0:     }
17:35:00.703 STDOUT terraform1.11.0:   # vault_kv_secret_v2.postgres will be created
17:35:00.703 STDOUT terraform1.11.0:   + resource "vault_kv_secret_v2" "postgres" {
17:35:00.703 STDOUT terraform1.11.0:       + data                = (sensitive value)
17:35:00.704 STDOUT terraform1.11.0:       + data_json           = (sensitive value)
17:35:00.704 STDOUT terraform1.11.0:       + delete_all_versions = true
17:35:00.704 STDOUT terraform1.11.0:       + disable_read        = false
17:35:00.704 STDOUT terraform1.11.0:       + id                  = (known after apply)
17:35:00.704 STDOUT terraform1.11.0:       + metadata            = (known after apply)
17:35:00.704 STDOUT terraform1.11.0:       + mount               = "secret"
17:35:00.704 STDOUT terraform1.11.0:       + name                = "postgres"
17:35:00.704 STDOUT terraform1.11.0:       + path                = (known after apply)
17:35:00.704 STDOUT terraform1.11.0:       + custom_metadata (known after apply)
17:35:00.704 STDOUT terraform1.11.0:     }
17:35:00.704 STDOUT terraform1.11.0:   # vault_kv_secret_v2.redis will be created
17:35:00.704 STDOUT terraform1.11.0:   + resource "vault_kv_secret_v2" "redis" {
17:35:00.704 STDOUT terraform1.11.0:       + data                = (sensitive value)
17:35:00.704 STDOUT terraform1.11.0:       + data_json           = (sensitive value)
17:35:00.704 STDOUT terraform1.11.0:       + delete_all_versions = true
17:35:00.704 STDOUT terraform1.11.0:       + disable_read        = false
17:35:00.704 STDOUT terraform1.11.0:       + id                  = (known after apply)
17:35:00.704 STDOUT terraform1.11.0:       + metadata            = (known after apply)
17:35:00.704 STDOUT terraform1.11.0:       + mount               = "secret"
17:35:00.704 STDOUT terraform1.11.0:       + name                = "redis"
17:35:00.704 STDOUT terraform1.11.0:       + path                = (known after apply)
17:35:00.704 STDOUT terraform1.11.0:       + custom_metadata (known after apply)
17:35:00.704 STDOUT terraform1.11.0:     }
17:35:00.704 STDOUT terraform1.11.0:   # vault_kv_secret_v2.signoz will be created
17:35:00.704 STDOUT terraform1.11.0:   + resource "vault_kv_secret_v2" "signoz" {
17:35:00.704 STDOUT terraform1.11.0:       + data                = (sensitive value)
17:35:00.704 STDOUT terraform1.11.0:       + data_json           = (sensitive value)
17:35:00.704 STDOUT terraform1.11.0:       + delete_all_versions = true
17:35:00.705 STDOUT terraform1.11.0:       + disable_read        = false
17:35:00.705 STDOUT terraform1.11.0:       + id                  = (known after apply)
17:35:00.705 STDOUT terraform1.11.0:       + metadata            = (known after apply)
17:35:00.705 STDOUT terraform1.11.0:       + mount               = "secret"
17:35:00.705 STDOUT terraform1.11.0:       + name                = "signoz"
17:35:00.705 STDOUT terraform1.11.0:       + path                = (known after apply)
17:35:00.705 STDOUT terraform1.11.0:       + custom_metadata (known after apply)
17:35:00.705 STDOUT terraform1.11.0:     }
17:35:00.705 STDOUT terraform1.11.0: Plan: 34 to add, 0 to change, 0 to destroy.
17:35:00.705 STDOUT terraform1.11.0: 
17:35:00.705 STDOUT terraform1.11.0: Changes to Outputs:
17:35:00.705 STDOUT terraform1.11.0:   ~ arangodb_host                 = "arangodb.data-default.svc.cluster.local" -> "arangodb.data-staging.svc.cluster.local"
17:35:00.705 STDOUT terraform1.11.0:   ~ clickhouse_host               = "clickhouse.data-default.svc.cluster.local" -> "clickhouse.data-staging.svc.cluster.local"
17:35:00.705 STDOUT terraform1.11.0:   ~ l3_namespace                  = "data-default" -> "data-staging"
17:35:00.705 STDOUT terraform1.11.0:   ~
17:35:00.705 STDOUT terraform1.11.0: m postgres_host                 = "postgresql.data-default.svc.cluster.local" -> "postgresql.data-staging.svc.cluster.local"
17:35:00.705 STDOUT terraform1.11.0:   ~ postgres_namespace            = "data-default" -> "data-staging"
17:35:00.705 STDOUT terraform1.11.0:   ~ redis_host                    = "redis-master.data-default.svc.cluster.local" -> "redis-master.data-staging.svc.cluster.local"
17:35:00.705 STDOUT terraform1.11.0: 
17:35:00.705 STDOUT terraform1.11.0: ─────────────────────────────────────────────────────────────────────────────
17:35:00.705 STDOUT terraform1.11.0: Saved the plan to:
17:35:00.705 STDOUT terraform1.11.0: ./data-staging-default.tfplan
17:35:00.705 STDOUT terraform1.11.0: To perform exactly these actions, run the following command to apply:
17:35:00.705 STDOUT terraform1.11.0:     terraform apply "./data-staging-default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p data-staging
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252Fenvs%252Fstaging%252Fdata%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p data-staging
  ```
Plan: 34 to add, 0 to change, 0 to destroy.

---
### 2. project: `data-prod` dir: `envs/prod/data` workspace: `default`
<details><summary>Show Output</summary>

```diff
infra-flash-commit:0a4be30 

Terragrunt already installed: terragrunt version v0.96.1

Cleaning old generated .tf files...
✅ Cleanup complete

17:34:45.328 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
17:34:45.384 WARN   Config ../../../platform/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
17:34:45.439 INFO   terraform1.11.0: Initializing the backend...
17:34:45.533 INFO   terraform1.11.0: 
17:34:45.533 INFO   terraform1.11.0: Successfully configured the backend "s3"! Terraform will automatically
17:34:45.533 INFO   terraform1.11.0: use this backend unless the backend configuration changes.
17:34:45.701 INFO   terraform1.11.0: Initializing provider plugins...
17:34:45.701 INFO   terraform1.11.0: - terraform.io/builtin/terraform is built in to Terraform
17:34:45.701 INFO   terraform1.11.0: - Finding latest version of hashicorp/external...
17:34:45.723 INFO   terraform1.11.0: - Reusing previous version of clickhouse/clickhousedbops from the dependency lock file
17:34:45.733 INFO   terraform1.11.0: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
17:34:45.744 INFO   terraform1.11.0: - Reusing previous version of hashicorp/time from the dependency lock file
17:34:45.754 INFO   terraform1.11.0: - Reusing previous version of hashicorp/helm from the dependency lock file
17:34:45.765 INFO   terraform1.11.0: - Reusing previous version of hashicorp/vault from the dependency lock file
17:34:45.778 INFO   terraform1.11.0: - Reusing previous version of hashicorp/random from the dependency lock file
17:34:45.788 INFO   terraform1.11.0: - Reusing previous version of alekc/kubectl from the dependency lock file
17:34:45.855 INFO   terraform1.11.0: - Installing hashicorp/time v0.13.1...
17:34:46.220 INFO   terraform1.11.0: - Installed hashicorp/time v0.13.1 (signed by HashiCorp)
17:34:46.278 INFO   terraform1.11.0: - Installing hashicorp/helm v2.17.0...
17:34:47.251 INFO   terraform1.11.0: - Installed hashicorp/helm v2.17.0 (signed by HashiCorp)
17:34:47.314 INFO   terraform1.11.0: - Installing hashicorp/vault v4.8.0...
17:34:47.966 INFO   terraform1.11.0: - Installed hashicorp/vault v4.8.0 (signed by HashiCorp)
17:34:48.016 INFO   terraform1.11.0: - Installing hashicorp/random v3.7.2...
17:34:48.371 INFO   terraform1.11.0: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
17:34:49.025 INFO   terraform1.11.0: - Installing alekc/kubectl v2.1.3...
17:34:50.302 INFO   terraform1.11.0: - Installed alekc/kubectl v2.1.3 (self-signed, key ID 772FB27A86DAFCE7)
17:34:50.351 INFO   terraform1.11.0: - Installing hashicorp/external v2.3.5...
17:34:50.639 INFO   terraform1.11.0: - Installed hashicorp/external v2.3.5 (signed by HashiCorp)
17:34:51.314 INFO   terraform1.11.0: - Installing clickhouse/clickhousedbops v0.3.0...
17:34:52.235 INFO   terraform1.11.0: - Installed clickhouse/clickhousedbops v0.3.0 (signed by a HashiCorp partner, key ID 7A297D628881685E)
17:34:52.289 INFO   terraform1.11.0: - Installing hashicorp/kubernetes v2.38.0...
17:34:54.009 INFO   terraform1.11.0: - Installed hashicorp/kubernetes v2.38.0 (signed by HashiCorp)
17:34:54.009 INFO   terraform1.11.0: Partner and community providers are signed by their developers.
17:34:54.013 INFO   terraform1.11.0: If you'd like to know more about provider signing, you can read about it here:
17:34:54.013 INFO   terraform1.11.0: https://www.terraform.io/docs/cli/plugins/signing.html
17:34:54.013 INFO   terraform1.11.0: Terraform has made some changes to the provider dependency selections recorded
17:34:54.014 INFO   terraform1.11.0: in the .terraform.lock.hcl file. Review those changes and commit them to your
17:34:54.014 INFO   terraform1.11.0: version control system if they represent changes you intended to make.
17:34:54.014 INFO   terraform1.11.0: Terraform has been successfully initialized!
17:34:54.014 INFO   terraform1.11.0: 
17:34:54.014 INFO   terraform1.11.0: You may now begin working with Terraform. Try running "terraform plan" to see
17:34:54.014 INFO   terraform1.11.0: any changes that are required for your infrastructure. All Terraform commands
17:34:54.014 INFO   terraform1.11.0: should now work.
17:34:54.014 INFO   terraform1.11.0: If you ever set or change modules or backend configuration for Terraform,
17:34:54.014 INFO   terraform1.11.0: rerun this command to reinitialize your working directory. If you forget, other
17:34:54.014 INFO   terraform1.11.0: commands will detect it and remind you to do so if necessary.
17:34:56.436 STDOUT terraform1.11.0: data.terraform_remote_state.l2_platform: Reading...
17:34:56.441 STDOUT terraform1.11.0: random_password.postgres: Refreshing state... [id=none]
17:34:56.443 STDOUT terraform1.11.0: random_password.signoz_clickhouse: Refreshing state... [id=none]
17:34:56.444 STDOUT terraform1.11.0: random_password.openpanel_postgres: Refreshing state... [id=none]
17:34:56.444 STDOUT terraform1.11.0: random_password.openpanel_clickhouse: Refreshing state... [id=none]
17:34:56.445 STDOUT terraform1.11.0: random_password.clickhouse: Refreshing state... [id=none]
17:34:56.446 STDOUT terraform1.11.0: random_password.arangodb: Refreshing state... [id=none]
17:34:56.447 STDOUT terraform1.11.0: random_password.redis: Refreshing state... [id=none]
17:34:56.447 STDOUT terraform1.11.0: kubernetes_namespace.data: Refreshing state... [id=data-prod]
17:34:56.448 STDOUT terraform1.11.0: random_bytes.arangodb_jwt: Refreshing state...
17:34:56.498 STDOUT terraform1.11.0: kubernetes_secret.arangodb_jwt: Refreshing state... [id=data-prod/arangodb-jwt]
17:34:56.517 STDOUT terraform1.11.0: helm_release.arangodb_operator: Refreshing state... [id=arangodb-operator]
17:34:56.625 STDOUT terraform1.11.0: data.terraform_remote_state.l2_platform: Read complete after 1s
17:34:56.650 STDOUT terraform1.11.0: vault_kv_secret_v2.clickhouse: Refreshing state... [id=secret/data/clickhouse]
17:34:56.650 STDOUT terraform1.11.0: vault_kv_secret_v2.redis: Refreshing state... [id=secret/data/redis]
17:34:56.652 STDOUT terraform1.11.0: vault_kv_secret_v2.arangodb: Refreshing state... [id=secret/data/arangodb]
17:34:56.655 STDOUT terraform1.11.0: vault_kv_secret_v2.postgres: Refreshing state... [id=secret/data/postgres]
17:34:56.738 STDOUT terraform1.11.0: helm_release.postgresql: Refreshing state... [id=postgresql]
17:34:56.740 STDOUT terraform1.11.0: helm_release.clickhouse: Refreshing state... [id=clickhouse]
17:34:56.740 STDOUT terraform1.11.0: helm_release.redis: Refreshing state... [id=redis]
17:34:56.826 STDOUT terraform1.11.0: time_sleep.wait_for_arangodb_crd: Refreshing state... [id=2025-12-23T03:02:50Z]
17:34:56.837 STDOUT terraform1.11.0: kubectl_manifest.arangodb_deployment: Refreshing state... [id=/apis/database.arangodb.com/v1/namespaces/data-prod/arangodeployments/arangodb]
17:34:59.220 STDOUT terraform1.11.0: time_sleep.wait_for_clickhouse: Refreshing state... [id=2025-12-23T03:02:26Z]
17:34:59.234 STDOUT terraform1.11.0: vault_kv_secret_v2.signoz: Refreshing state... [id=secret/data/signoz]
17:35:01.695 STDOUT terraform1.11.0: vault_kv_secret_v2.openpanel: Refreshing state... [id=secret/data/openpanel]
17:35:01.811 STDOUT terraform1.11.0: Terraform used the selected providers to generate the following execution
17:35:01.811 STDOUT terraform1.11.0: plan. Resource actions are indicated with the following symbols:
17:35:01.811 STDOUT terraform1.11.0:   + create
17:35:01.811 STDOUT terraform1.11.0:   ~ update in-place
17:35:01.811 STDOUT terraform1.11.0:   - destroy
17:35:01.811 STDOUT terraform1.11.0: Terraform will perform the following actions:
17:35:01.811 STDOUT terraform1.11.0:   # clickhousedbops_database.openpanel_events will be created
17:35:01.812 STDOUT terraform1.11.0:   + resource "clickhousedbops_database" "openpanel_events" {
17:35:01.812 STDOUT terraform1.11.0:       + name = "openpanel_events"
17:35:01.812 STDOUT terraform1.11.0:       + uuid = (known after apply)
17:35:01.812 STDOUT terraform1.11.0:     }
17:35:01.812 STDOUT terraform1.11.0:   # clickhousedbops_database.signoz_logs will be created
17:35:01.812 STDOUT terraform1.11.0:   + resource "clickhousedbops_database" "signoz_logs" {
17:35:01.812 STDOUT terraform1.11.0:       + name = "signoz_logs"
17:35:01.812 STDOUT terraform1.11.0:       + uuid = (known after apply)
17:35:01.812 STDOUT terraform1.11.0:     }
17:35:01.812 STDOUT terraform1.11.0:   # clickhousedbops_database.signoz_metrics will be created
17:35:01.812 STDOUT terraform1.11.0:   + resource "clickhousedbops_database" "signoz_metrics" {
17:35:01.812 STDOUT terraform1.11.0:       + name = "signoz_metrics"
17:35:01.812 STDOUT terraform1.11.0:       + uuid = (known after apply)
17:35:01.812 STDOUT terraform1.11.0:     }
17:35:01.812 STDOUT terraform1.11.0:   # clickhousedbops_database.signoz_traces will be created
17:35:01.812 STDOUT terraform1.11.0:   + resource "clickhousedbops_database" "signoz_traces" {
17:35:01.813 STDOUT terraform1.11.0:       + name = "signoz_traces"
17:35:01.813 STDOUT terraform1.11.0:       + uuid = (known after apply)
17:35:01.813 STDOUT terraform1.11.0:     }
17:35:01.813 STDOUT terraform1.11.0:   # clickhousedbops_user.openpanel will be created
17:35:01.813 STDOUT terraform1.11.0:   + resource "clickhousedbops_user" "openpanel" {
17:35:01.813 STDOUT terraform1.11.0:       + id                              = (known after apply)
17:35:01.813 STDOUT terraform1.11.0:       + name                            = "openpanel"
17:35:01.813 STDOUT terraform1.11.0:       + password_sha256_hash_wo         = (write-only attribute)
17:35:01.813 STDOUT terraform1.11.0:       + password_sha256_hash_wo_version = 1
17:35:01.813 STDOUT terraform1.11.0:     }
17:35:01.813 STDOUT terraform1.11.0:   # clickhousedbops_user.signoz will be created
17:35:01.813 STDOUT terraform1.11.0:   + resource "clickhousedbops_user" "signoz" {
17:35:01.813 STDOUT terraform1.11.0:       + id                              = (known after apply)
17:35:01.813 STDOUT terraform1.11.0:       + name                            = "signoz"
17:35:01.813 STDOUT terraform1.11.0:       + password_sha256_hash_wo         = (write-only attribute)
17:35:01.813 STDOUT terraform1.11.0:       + password_sha256_hash_wo_version = 1
17:35:01.813 STDOUT terraform1.11.0:     }
17:35:01.813 STDOUT terraform1.11.0:   # helm_release.clickhouse will be updated in-place
17:35:01.813 STDOUT terraform1.11.0:   ~ resource "helm_release" "clickhouse" {
17:35:01.813 STDOUT terraform1.11.0:         id                         = "clickhouse"
17:35:01.814 STDOUT terraform1.11.0:       ~ metadata                   = [
17:35:01.814 STDOUT terraform1.11.0:           - {
17:35:01.814 STDOUT terraform1.11.0:               - app_version    = "25.7.5"
17:35:01.814 STDOUT terraform1.11.0:               - chart          = "clickhouse"
17:35:01.814 STDOUT terraform1.11.0:               - first_deployed = 1765804341
17:35:01.814 STDOUT terraform1.11.0:               - last_deployed  = 1766458899
17:35:01.814 STDOUT terraform1.11.0:               - name           = "clickhouse"
17:35:01.814 STDOUT terraform1.11.0:               - namespace      = "data-prod"
17:35:01.814 STDOUT terraform1.11.0:               - notes          = <<-EOT
17:35:01.814 STDOUT terraform1.11.0:                     CHART NAME: clickhouse
17:35:01.814 STDOUT terraform1.11.0:                     CHART VERSION: 9.4.4
17:35:01.814 STDOUT terraform1.11.0:                     APP VERSION: 25.7.5
17:35:01.814 STDOUT terraform1.11.0:                     
17:35:01.814 STDOUT terraform1.11.0:                     ⚠ WARNING: Since August 28th, 2025, only a limited subset of images/charts are available for free.
17:35:01.814 STDOUT terraform1.11.0:                         Subscribe to Bitnami Secure Images to receive continued support and security updates.
17:35:01.814 STDOUT terraform1.11.0:                         More info at https://bitnami.com and https://github.com/bitnami/containers/issues/83267
17:35:01.814 STDOUT terraform1.11.0:                     
17:35:01.814 STDOUT terraform1.11.0:                     ** Please be patient while the chart is being deployed **
17:35:01.814 STDOUT terraform1.11.0:                     
17:35:01.814 STDOUT terraform1.11.0:                     ClickHouse can be accessed on the following DNS name from within your cluster:
17:35:01.814 STDOUT terraform1.11.0:                     
17:35:01.814 STDOUT terraform1.11.0:                         clickhouse.data-prod.svc.cluster.local (port 9000)
17:35:01.814 STDOUT terraform1.11.0:                     
17:35:01.814 STDOUT terraform1.11.0:                     To connect to your ClickHouse from outside the cluster execute the following commands:
17:35:01.814 STDOUT terraform1.11.0:                     
17:35:01.814 STDOUT terraform1.11.0:                         kubectl port-forward --namespace data-prod svc/clickhouse 9000:9000 &
17:35:01.815 STDOUT terraform1.11.0:                     
17:35:01.815 STDOUT terraform1.11.0:                     Credentials:
17:35:01.815 STDOUT terraform1.11.0:                     
17:35:01.815 STDOUT terraform1.11.0:                         echo "Username: default"
17:35:01.815 STDOUT terraform1.11.0:                         echo "Password: $(kubectl get secret --namespace data-prod clickhouse -o jsonpath="{.data.admin-password}" | base64 -d)"
17:35:01.815 STDOUT terraform1.11.0:                     
17:35:01.815 STDOUT terraform1.11.0:                     ⚠ SECURITY WARNING: Original containers have been substituted. This Helm chart was designed, tested, and validated on multiple platforms using a specific set of Bitnami and Tanzu Application Catalog containers. Substituting other containers is likely to cause degraded security and performance, broken chart features, and missing environment variables.
17:35:01.815 STDOUT terraform1.11.0:                     
17:35:01.815 STDOUT terraform1.11.0:                     Substituted images detected:
17:35:01.815 STDOUT terraform1.11.0:                       - docker.io/bitnamilegacy/clickhouse:25.7.5-debian-12-r0
17:35:01.815 STDOUT terraform1.11.0:                     
17:35:01.815 STDOUT terraform1.11.0:                     ⚠ WARNING: Original containers have been substituted for unrecognized ones. Deploying this chart with non-standard containers is likely to cause degraded security and performance, broken chart features, and missing environment variables.
17:35:01.815 STDOUT terraform1.11.0:                     
17:35:01.815 STDOUT terraform1.11.0:                     Unrecognized images:
17:35:01.815 STDOUT terraform1.11.0:                       - docker.io/bitnamilegacy/clickhouse:25.7.5-debian-12-r0
17:35:01.815 STDOUT terraform1.11.0:                 EOT
17:35:01.815 STDOUT terraform1.11.0:               - revision       = 4
17:35:01.815 STDOUT terraform1.11.0:               - values         = jsonencode(
17:35:01.815 STDOUT terraform1.11.0:                     {
17:35:01.815 STDOUT terraform1.11.0:                       - auth         = {
17:35:01.815 STDOUT terraform1.11.0:                           - password = "6vnt8XQGdUVrMEiLLtgtrhyJEV754m0r"
17:35:01.815 STDOUT terraform1.11.0:                           - username = "default"
17:35:01.815 STDOUT terraform1.11.0:                         }
17:35:01.815 STDOUT terraform1.11.0:                       - image        = {
17:35:01.816 STDOUT terraform1.11.0:                           - pullPolicy = "IfNotPresent"
17:35:01.816 STDOUT terraform1.11.0:                           - registry   = "docker.io"
17:35:01.816 STDOUT terraform1.11.0:                           - repository = "bitnamilegacy/clickhouse"
17:35:01.816 STDOUT terraform1.11.0:                           - tag        = "25.7.5-debian-12-r0"
17:35:01.816 STDOUT terraform1.11.0:                         }
17:35:01.816 STDOUT terraform1.11.0:                       - keeper       = {
17:35:01.816 STDOUT terraform1.11.0:                           - enabled = false
17:35:01.816 STDOUT terraform1.11.0:                         }
17:35:01.816 STDOUT terraform1.11.0:                       - persistence  = {
17:35:01.816 STDOUT terraform1.11.0:                           - enabled      = true
17:35:01.816 STDOUT terraform1.11.0:                           - size         = "10Gi"
17:35:01.816 STDOUT terraform1.11.0:                           - storageClass = "local-path-retain"
17:35:01.816 STDOUT terraform1.11.0:                         }
17:35:01.816 STDOUT terraform1.11.0:                       - replicaCount = 1
17:35:01.816 STDOUT terraform1.11.0:                       - resources    = {
17:35:01.816 STDOUT terraform1.11.0:                           - limits   = {
17:35:01.816 STDOUT terraform1.11.0:                               - cpu    = "1000m"
17:35:01.816 STDOUT terraform1.11.0:                               - memory = "1Gi"
17:35:01.816 STDOUT terraform1.11.0:                             }
17:35:01.816 STDOUT terraform1.11.0:                           - requests = {
17:35:01.816 STDOUT terraform1.11.0:                               - cpu    = "200m"
17:35:01.816 STDOUT terraform1.11.0:                               - memory = "256Mi"
17:35:01.817 STDOUT terraform1.11.0:                             }
17:35:01.817 STDOUT terraform1.11.0:                         }
17:35:01.817 STDOUT terraform1.11.0:                       - shards       = 1
17:35:01.817 STDOUT terraform1.11.0:                       - zookeeper    = {
17:35:01.817 STDOUT terraform1.11.0:                           - enabled = false
17
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.